from django.urls import path
from . import views

# 📌 게시판(boards) 관련된 대표 app name 선언
app_name = 'boards'


"""
📌 게시판(boards) 관련 URL 관리

    - <int:post_id>  URL로 전달된 게시글 PK
"""
urlpatterns = [
    # 🟢 홈 ------------------------------------------------------------------------
    path('', views.home, name='home'),                
                                  
    # 🟢 카테고리별 게시글 목록 -------------------------------------------------------
    # - 특정 카테고리에 속한 게시글만 필터링해서 조회
    path( "category/<int:category_id>", views.post_list, name="post_list"),         
    
    # 🟢 게시글 상세 페이지 ----------------------------------------------------------
    # - 특정 게시글 1건의 상세 내용 조회
    path( "post/<int:post_id>", views.post_detail , name="post_detail"),            
    
    # 🟢 게시글 작성 페이지 ----------------------------------------------------------
    # - 로그인 사용자만 접근 가능 (보통 @login_required 사용)
    # - GET  : 글 작성 폼 표시
    # - POST : 게시글 저장 처리    
    path( "post/create/", views.post_create , name="post_create"),                  
    
    # 🟢 게시글 수정 페이지 ----------------------------------------------------------
    # - 작성자 본인만 수정 가능 (권한 체크 필요)
    # - GET  : 기존 글 내용을 폼에 채워서 표시
    # - POST : 수정 내용 저장    
    path( "post/<int:post_id>/edit/", views.post_update , name="post_update"),      
    
    # 🟢 게시글 삭제 처리 -------------------------------------------------------------
    # - 작성자 본인만 삭제 가능
    # - 보통 POST 요청으로만 처리 (보안)
    # - 삭제 후 목록 페이지로 redirect
    path( "post/<int:post_id>/delete/", views.post_delete , name="post_delete"),    
]
