# 📌 문자열 ===================================================
# '문자'로 이루어진 [문자 배열]
# 읽기 전용 리스트

text = 'Python'
print(text[0]) # P
print(text[1]) # y

# 📌 자주 사용하는 문자열 메서드 =================================
text = '  Hello Python World  '

# ✅ 대소문자 변환
print('\n 대소문자 변환 ---------------')
print(text.upper()) # 전체 대문자 변환
print(text.lower()) # 전체 소문자 변환
print(text.title()) # 단어의 첫 글자만 대문자로 변환

# ✅ 공백 제거 
# 사용자 입력 데이터 / CSV / API 데이터 정제 시 필수
print('\n 공백 제거 ---------------- ')
print(text.strip())     # 양쪽 공백 제거
print(text.rstrip())    # 오른쪽 공백 제거
print(text.lstrip())    # 왼쪽 공백 제거

# ✅ 문자열 치환
# replace("as-is", "to-be")
print('\n 문자열 치환 ----------------')
print(text.replace("Python","Java"))

# ✅ 문자열 분리
# .split('구분자')
# 구분자를 기준으로 문자를 나눈 후 리스트 형태로 변환
print('\n 문자열 분리 ----------------')
words = "apple,banana,orange".split(",")
print(words)

# ✅ 문자열 결합 
# '연결 문자'.join(연결한 문자열)
# 연결할 문자열 사이 사이에 연결 문자를 삽입하여 하나의 문자열을 만듬
print('\n 문자열 결합 ----------------')
joined = "-".join(words)
print(joined)

# ✅ 문자열 포함여부
# 결과 Boolean
print('\n 문자열 포함 여부 ----------------')
email = "admin@test.com"

print("@" in email)
print(email.startswith("admin"))
print(email.endswith(".com"))

# ✅ 문자열 길이 & 카운트
print('\n 문자열 길이 & 카운트 ----------------')
text = "banana"

print(len(text))
print(text.count("a"))
